; ModuleID = 'asn1Parser.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.asn1_node_st = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@llvm.global_ctors = appending global [8 x { i32, void ()*, i8* }] [{ i32, void ()*, i8* } { i32 1, void ()* @asan.module_ctor, i8* null }, { i32, void ()*, i8* } { i32 2, void ()* @sancov.module_ctor, i8* null }, { i32, void ()*, i8* } { i32 1, void ()* @asan.module_ctor.4, i8* null }, { i32, void ()*, i8* } { i32 2, void ()* @sancov.module_ctor.23, i8* null }, { i32, void ()*, i8* } { i32 1, void ()* @asan.module_ctor.31, i8* null }, { i32, void ()*, i8* } { i32 2, void ()* @sancov.module_ctor.112, i8* null }, { i32, void ()*, i8* } { i32 1, void ()* @asan.module_ctor.125, i8* null }, { i32, void ()*, i8* } { i32 2, void ()* @sancov.module_ctor.129, i8* null }]

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !59)
!1 = !DIFile(filename: "asn1Parser.c", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/src")
!2 = !{}
!3 = !{!4, !6, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !30, !54}
!9 = distinct !DISubprogram(name: "LLVMFuzzerTestOneInput", scope: !1, file: !1, line: 67, type: !10, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, variables: !21)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !18}
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 48, baseType: !17)
!16 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/src")
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 62, baseType: !20)
!19 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/src")
!20 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DILocalVariable(name: "data", arg: 1, scope: !9, file: !1, line: 67, type: !13)
!23 = !DILocalVariable(name: "size", arg: 2, scope: !9, file: !1, line: 67, type: !18)
!24 = !DILocalVariable(name: "str", scope: !9, file: !1, line: 69, type: !4)
!25 = !DILocalVariable(name: "argc0", scope: !9, file: !1, line: 72, type: !12)
!26 = !DILocalVariable(name: "argv0", scope: !9, file: !1, line: 73, type: !27)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 64, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 2)
!30 = distinct !DISubprogram(name: "fuzz_main", scope: !1, file: !1, line: 81, type: !31, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, variables: !34)
!31 = !DISubroutineType(types: !32)
!32 = !{!12, !12, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !49, !53}
!35 = !DILocalVariable(name: "argc", arg: 1, scope: !30, file: !1, line: 81, type: !12)
!36 = !DILocalVariable(name: "argv", arg: 2, scope: !30, file: !1, line: 81, type: !33)
!37 = !DILocalVariable(name: "option_index", scope: !30, file: !1, line: 91, type: !12)
!38 = !DILocalVariable(name: "option_result", scope: !30, file: !1, line: 92, type: !12)
!39 = !DILocalVariable(name: "outputFileName", scope: !30, file: !1, line: 93, type: !4)
!40 = !DILocalVariable(name: "inputFileName", scope: !30, file: !1, line: 94, type: !4)
!41 = !DILocalVariable(name: "vectorName", scope: !30, file: !1, line: 95, type: !4)
!42 = !DILocalVariable(name: "checkSyntaxOnly", scope: !30, file: !1, line: 96, type: !12)
!43 = !DILocalVariable(name: "pointer", scope: !30, file: !1, line: 97, type: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "asn1_node", file: !45, line: 131, baseType: !46)
!45 = !DIFile(filename: "../lib/libtasn1.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/src")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "asn1_node_st", file: !45, line: 129, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_node_st", file: !45, line: 129, flags: DIFlagFwdDecl)
!49 = !DILocalVariable(name: "errorDescription", scope: !30, file: !1, line: 98, type: !50)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1024, align: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 128)
!53 = !DILocalVariable(name: "parse_result", scope: !30, file: !1, line: 99, type: !12)
!54 = distinct !DISubprogram(name: "usage", scope: !1, file: !1, line: 42, type: !55, isLocal: true, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, variables: !57)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !12}
!57 = !{!58}
!58 = !DILocalVariable(name: "status", arg: 1, scope: !54, file: !1, line: 42, type: !12)
!59 = !{!60}
!60 = !DIGlobalVariable(name: "long_options", scope: !30, file: !1, line: 83, type: !61, isLocal: true, isDefinition: true, variable: [6 x %struct.option]* getelementptr inbounds ({ [6 x %struct.option], [32 x i8] }, { [6 x %struct.option], [32 x i8] }* @fuzz_main.long_options, i32 0, i32 0))
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 1536, align: 64, elements: !73)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !64, line: 104, size: 256, align: 64, elements: !65)
!64 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/src")
!65 = !{!66, !69, !70, !72}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !64, line: 106, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !63, file: !64, line: 109, baseType: !12, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !63, file: !64, line: 110, baseType: !71, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !63, file: !64, line: 111, baseType: !12, size: 32, align: 32, offset: 192)
!73 = !{!74}
!74 = !DISubrange(count: 6)
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !77, subprograms: !78, globals: !86)
!76 = !DIFile(filename: "progname.c", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!77 = !{!6, !4}
!78 = !{!79}
!79 = distinct !DISubprogram(name: "set_program_name", scope: !76, file: !76, line: 39, type: !80, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, variables: !82)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !67}
!82 = !{!83, !84, !85}
!83 = !DILocalVariable(name: "argv0", arg: 1, scope: !79, file: !76, line: 39, type: !67)
!84 = !DILocalVariable(name: "slash", scope: !79, file: !76, line: 46, type: !67)
!85 = !DILocalVariable(name: "base", scope: !79, file: !76, line: 47, type: !67)
!86 = !{!87}
!87 = !DIGlobalVariable(name: "program_name", scope: !75, file: !76, line: 33, type: !67, isLocal: false, isDefinition: true, variable: i8** getelementptr inbounds ({ i8*, [56 x i8] }, { i8*, [56 x i8] }* @program_name, i32 0, i32 0))
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !90, retainedTypes: !94, subprograms: !95)
!89 = !DIFile(filename: "version-etc.c", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!90 = !{!91}
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 41, size: 32, align: 32, elements: !92)
!92 = !{!93}
!93 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!94 = !{!67, !6}
!95 = !{!96, !166, !176, !197, !211}
!96 = distinct !DISubprogram(name: "version_etc_arn", scope: !89, file: !89, line: 62, type: !97, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, variables: !159)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99, !67, !67, !67, !157, !150}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !101, line: 48, baseType: !102)
!101 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !103, line: 241, size: 1728, align: 64, elements: !104)
!103 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !125, !126, !127, !128, !132, !134, !136, !140, !143, !145, !146, !147, !148, !149, !152, !153}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !103, line: 242, baseType: !12, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !102, file: !103, line: 247, baseType: !4, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !102, file: !103, line: 248, baseType: !4, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !102, file: !103, line: 249, baseType: !4, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !102, file: !103, line: 250, baseType: !4, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !102, file: !103, line: 251, baseType: !4, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !102, file: !103, line: 252, baseType: !4, size: 64, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !102, file: !103, line: 253, baseType: !4, size: 64, align: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !102, file: !103, line: 254, baseType: !4, size: 64, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !102, file: !103, line: 256, baseType: !4, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !102, file: !103, line: 257, baseType: !4, size: 64, align: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !102, file: !103, line: 258, baseType: !4, size: 64, align: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !102, file: !103, line: 260, baseType: !118, size: 64, align: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !103, line: 156, size: 192, align: 64, elements: !120)
!120 = !{!121, !122, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !119, file: !103, line: 157, baseType: !118, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !119, file: !103, line: 158, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !119, file: !103, line: 162, baseType: !12, size: 32, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !102, file: !103, line: 262, baseType: !123, size: 64, align: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !102, file: !103, line: 264, baseType: !12, size: 32, align: 32, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !102, file: !103, line: 268, baseType: !12, size: 32, align: 32, offset: 928)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !102, file: !103, line: 270, baseType: !129, size: 64, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !130, line: 131, baseType: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!131 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !102, file: !103, line: 274, baseType: !133, size: 16, align: 16, offset: 1024)
!133 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !102, file: !103, line: 275, baseType: !135, size: 8, align: 8, offset: 1040)
!135 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !102, file: !103, line: 276, baseType: !137, size: 8, align: 8, offset: 1048)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, align: 8, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 1)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !102, file: !103, line: 280, baseType: !141, size: 64, align: 64, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !103, line: 150, baseType: null)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !103, line: 289, baseType: !144, size: 64, align: 64, offset: 1152)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !130, line: 132, baseType: !131)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !102, file: !103, line: 297, baseType: !6, size: 64, align: 64, offset: 1216)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !102, file: !103, line: 298, baseType: !6, size: 64, align: 64, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !102, file: !103, line: 299, baseType: !6, size: 64, align: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !102, file: !103, line: 300, baseType: !6, size: 64, align: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !102, file: !103, line: 302, baseType: !150, size: 64, align: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !151, line: 62, baseType: !20)
!151 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !102, file: !103, line: 303, baseType: !12, size: 32, align: 32, offset: 1536)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !102, file: !103, line: 305, baseType: !154, size: 160, align: 8, offset: 1568)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 20)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DILocalVariable(name: "stream", arg: 1, scope: !96, file: !89, line: 62, type: !99)
!161 = !DILocalVariable(name: "command_name", arg: 2, scope: !96, file: !89, line: 63, type: !67)
!162 = !DILocalVariable(name: "package", arg: 3, scope: !96, file: !89, line: 63, type: !67)
!163 = !DILocalVariable(name: "version", arg: 4, scope: !96, file: !89, line: 64, type: !67)
!164 = !DILocalVariable(name: "authors", arg: 5, scope: !96, file: !89, line: 65, type: !157)
!165 = !DILocalVariable(name: "n_authors", arg: 6, scope: !96, file: !89, line: 65, type: !150)
!166 = distinct !DISubprogram(name: "version_etc_ar", scope: !89, file: !89, line: 180, type: !167, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, variables: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !99, !67, !67, !67, !157}
!169 = !{!170, !171, !172, !173, !174, !175}
!170 = !DILocalVariable(name: "stream", arg: 1, scope: !166, file: !89, line: 180, type: !99)
!171 = !DILocalVariable(name: "command_name", arg: 2, scope: !166, file: !89, line: 181, type: !67)
!172 = !DILocalVariable(name: "package", arg: 3, scope: !166, file: !89, line: 181, type: !67)
!173 = !DILocalVariable(name: "version", arg: 4, scope: !166, file: !89, line: 182, type: !67)
!174 = !DILocalVariable(name: "authors", arg: 5, scope: !166, file: !89, line: 182, type: !157)
!175 = !DILocalVariable(name: "n_authors", scope: !166, file: !89, line: 184, type: !150)
!176 = distinct !DISubprogram(name: "version_etc_va", scope: !89, file: !89, line: 196, type: !177, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, variables: !186)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !99, !67, !67, !67, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !89, line: 189, size: 192, align: 64, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !180, file: !89, line: 189, baseType: !7, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !180, file: !89, line: 189, baseType: !7, size: 32, align: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !180, file: !89, line: 189, baseType: !6, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !180, file: !89, line: 189, baseType: !6, size: 64, align: 64, offset: 128)
!186 = !{!187, !188, !189, !190, !191, !192, !193}
!187 = !DILocalVariable(name: "stream", arg: 1, scope: !176, file: !89, line: 196, type: !99)
!188 = !DILocalVariable(name: "command_name", arg: 2, scope: !176, file: !89, line: 197, type: !67)
!189 = !DILocalVariable(name: "package", arg: 3, scope: !176, file: !89, line: 197, type: !67)
!190 = !DILocalVariable(name: "version", arg: 4, scope: !176, file: !89, line: 198, type: !67)
!191 = !DILocalVariable(name: "authors", arg: 5, scope: !176, file: !89, line: 198, type: !179)
!192 = !DILocalVariable(name: "n_authors", scope: !176, file: !89, line: 200, type: !150)
!193 = !DILocalVariable(name: "authtab", scope: !176, file: !89, line: 201, type: !194)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 640, align: 64, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 10)
!197 = distinct !DISubprogram(name: "version_etc", scope: !89, file: !89, line: 227, type: !198, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !99, !67, !67, !67, null}
!200 = !{!201, !202, !203, !204, !205}
!201 = !DILocalVariable(name: "stream", arg: 1, scope: !197, file: !89, line: 227, type: !99)
!202 = !DILocalVariable(name: "command_name", arg: 2, scope: !197, file: !89, line: 228, type: !67)
!203 = !DILocalVariable(name: "package", arg: 3, scope: !197, file: !89, line: 228, type: !67)
!204 = !DILocalVariable(name: "version", arg: 4, scope: !197, file: !89, line: 229, type: !67)
!205 = !DILocalVariable(name: "authors", scope: !197, file: !89, line: 231, type: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !101, line: 79, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !208, line: 50, baseType: !209)
!208 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stdarg.h", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !89, line: 231, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 192, align: 64, elements: !138)
!211 = distinct !DISubprogram(name: "emit_bug_reporting_address", scope: !89, file: !89, line: 239, type: !212, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, variables: !2)
!212 = !DISubroutineType(types: !213)
!213 = !{null}
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, globals: !216)
!215 = !DIFile(filename: "version-etc-fsf.c", directory: "/home/icy/comp/libtasn1/libtasn1-4.12/gl")
!216 = !{!217}
!217 = !DIGlobalVariable(name: "version_etc_copyright", scope: !214, file: !215, line: 26, type: !218, isLocal: false, isDefinition: true, variable: [47 x i8]* getelementptr inbounds ({ [47 x i8], [49 x i8] }, { [47 x i8], [49 x i8] }* @version_etc_copyright, i32 0, i32 0))
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 376, align: 8, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 47)
!221 = !{[11 x i8]* getelementptr inbounds ({ [11 x i8], [53 x i8] }, { [11 x i8], [53 x i8] }* @.str, i32 0, i32 0), !222, !"<string literal>", i1 false, i1 false}
!222 = !{!"asn1Parser.c", i32 74, i32 28}
!223 = !{[5 x i8]* getelementptr inbounds ({ [5 x i8], [59 x i8] }, { [5 x i8], [59 x i8] }* @.str.1, i32 0, i32 0), !224, !"<string literal>", i1 false, i1 false}
!224 = !{!"asn1Parser.c", i32 84, i32 6}
!225 = !{[8 x i8]* getelementptr inbounds ({ [8 x i8], [56 x i8] }, { [8 x i8], [56 x i8] }* @.str.2, i32 0, i32 0), !226, !"<string literal>", i1 false, i1 false}
!226 = !{!"asn1Parser.c", i32 85, i32 6}
